src/main/resources/SupermercadoWS.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 3.0.1 git-revision#6a0a3a3. -->
<definitions targetNamespace="http://services.supermercadosoap.das.ubp.edu.ar/" name="SupermercadoWS" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://services.supermercadosoap.das.ubp.edu.ar/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://services.supermercadosoap.das.ubp.edu.ar/" schemaLocation="SupermercadoWS_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="obtenerListaPrecios">
    <part name="parameters" element="tns:obtenerListaPreciosRequest"/>
  </message>
  <message name="obtenerListaPreciosResponse">
    <part name="parameters" element="tns:obtenerListaPreciosResponse"/>
  </message>
  <message name="obtenerInfoSucursales">
    <part name="parameters" element="tns:obtenerInfoSucursalesRequest"/>
  </message>
  <message name="obtenerInfoSucursalesResponse">
    <part name="parameters" element="tns:obtenerInfoSucursalesResponse"/>
  </message>
  <portType name="SupermercadoWS">
    <operation name="obtenerListaPrecios">
      <input wsam:Action="http://services.supermercadosoap.das.ubp.edu.ar/SupermercadoWS/obtenerListaPreciosRequest" message="tns:obtenerListaPrecios"/>
      <output wsam:Action="http://services.supermercadosoap.das.ubp.edu.ar/SupermercadoWS/obtenerListaPreciosResponse" message="tns:obtenerListaPreciosResponse"/>
    </operation>
    <operation name="obtenerInfoSucursales">
      <input wsam:Action="http://services.supermercadosoap.das.ubp.edu.ar/SupermercadoWS/obtenerInfoSucursalesRequest" message="tns:obtenerInfoSucursales"/>
      <output wsam:Action="http://services.supermercadosoap.das.ubp.edu.ar/SupermercadoWS/obtenerInfoSucursalesResponse" message="tns:obtenerInfoSucursalesResponse"/>
    </operation>
  </portType>
  <binding name="SupermercadoWSPortBinding" type="tns:SupermercadoWS">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="obtenerListaPrecios">
      <soap12:operation soapAction=""/>
      <input>
        <soap12:body use="literal"/>
      </input>
      <output>
        <soap12:body use="literal"/>
      </output>
    </operation>
    <operation name="obtenerInfoSucursales">
      <soap12:operation soapAction=""/>
      <input>
        <soap12:body use="literal"/>
      </input>
      <output>
        <soap12:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="SupermercadoWS">
    <port name="SupermercadoWSPort" binding="tns:SupermercadoWSPortBinding">
      <soap12:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

